type VOTE_SUBJECT = {
	html_name: string;
	icon: 'choose' | 'normal' | 'distrust';
};

export const VOTE_METADATA: VOTE_SUBJECT[] = [
	{
		html_name: '<strong>ลงมติเลือกนายกรัฐมนตรี</strong> (2562)',
		icon: 'choose'
	},
	{
		html_name:
			'พ.ร.ก.<strong>โอนอัตรากำลังพลและงบประมาณบางส่วน</strong>ไปเป็นของหน่วยบัญชาการ<strong>ถวายความปลอดภัยรักษาพระองค์</strong> (2562)',
		icon: 'normal'
	},
	{
		html_name: 'ลงมติ<strong>พ.ร.บ.งบประมาณฯ 2563</strong> (วาระ 1) (2562)',
		icon: 'normal'
	},
	{
		html_name:
			'ตั้ง <strong>กมธ.วิสามัญ</strong> เพื่อตรวจสอบและศึกษาติดตาม<strong>การละเมิดสิทธิมนุษยชนโดยรัฐ</strong> (2562)',
		icon: 'normal'
	},
	{
		html_name:
			'ตั้ง <strong>กมธ. วิสามัญ</strong> ศึกษาแนวทาง<strong>ป้องกันไม่ให้เกิดการรัฐประหารขึ้นอีกในอนาคต</strong> (2562)',
		icon: 'normal'
	},
	{
		html_name:
			'!!! <strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'!!! <strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'!!! <strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'!!! <strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'!!! <strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'!!! <strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'พิจารณารับหลักการ หรือไม่รับหลักการ<strong>ร่างแก้ไขรัฐธรรมนูญจำนวน 7 ฉบับ</strong> (ฉบับที่ 1) (2563)',
		icon: 'normal'
	},
	{
		html_name:
			'พิจารณารับหลักการ หรือไม่รับหลักการ<strong>ร่างแก้ไขรัฐธรรมนูญจำนวน 7 ฉบับ</strong> (ฉบับที่ 2) (2563)',
		icon: 'normal'
	},
	{
		html_name:
			'พิจารณารับหลักการ หรือไม่รับหลักการ<strong>ร่างแก้ไขรัฐธรรมนูญจำนวน 7 ฉบับ</strong> (ฉบับที่ 3) (2563)',
		icon: 'normal'
	},
	{
		html_name:
			'พิจารณารับหลักการ หรือไม่รับหลักการ<strong>ร่างแก้ไขรัฐธรรมนูญจำนวน 7 ฉบับ</strong> (ฉบับที่ 4) (2563)',
		icon: 'normal'
	},
	{
		html_name:
			'พิจารณารับหลักการ หรือไม่รับหลักการ<strong>ร่างแก้ไขรัฐธรรมนูญจำนวน 7 ฉบับ</strong> (ฉบับที่ 5) (2563)',
		icon: 'normal'
	},
	{
		html_name:
			'พิจารณารับหลักการ หรือไม่รับหลักการ<strong>ร่างแก้ไขรัฐธรรมนูญจำนวน 7 ฉบับ</strong> (ฉบับที่ 6) (2563)',
		icon: 'normal'
	},
	{
		html_name:
			'พิจารณารับหลักการ หรือไม่รับหลักการ<strong>ร่างแก้ไขรัฐธรรมนูญจำนวน 7 ฉบับ</strong> (ฉบับที่ 7) (2563)',
		icon: 'normal'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประวิตร วงษ์สุวรรณ</strong> รองนายกรัฐมนตรี (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายอนุทิน ชาญวีรกูล</strong> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายจุรินทร์ ลักษณวิศิษฏ์</strong> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์ (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอก อนุพงษ์ เผ่าจินดา</strong> รัฐมนตรีว่าการกระทรวงมหาดไทย (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายณัฏฐพล ทีปสุวรรณ</strong> รัฐมนตรีว่าการกระทรวงศึกษาธิการ (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสุชาติ ชมกลิ่น</strong> รัฐมนตรีว่าการกระทรวงแรงงาน (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายศักดิ์สยาม ชิดชอบ</strong> รัฐมนตรีว่าการกระทรวงคมนาคม (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายนิพนธ์ บุญญามณี</strong> รัฐมนตรีช่วยว่าการกระทรวงมหาดไทย (2563)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - ร้อยเอก ธรรมนัส พรมเผ่า</strong> รัฐมนตรีช่วยว่าการเกษตรและสหกรณ์ (2563)',
		icon: 'distrust'
	},
	{ html_name: 'โหวตพ.ร.ก.เงินกู้ เพิ่มเติม (2564)', icon: 'normal' },
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (2564)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายอนุทิน ชาญวีรกูล</strong> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข (2564)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสุชาติ ชมกลิ่น</strong> รัฐมนตรีว่าการกระทรวงแรงงาน (2564)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายศักดิ์สยาม ชิดชอบ</strong> รัฐมนตรีว่าการกระทรวงคมนาคม (2564)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายเฉลิมชัย ศรีอ่อน</strong> รัฐมนตรีว่าการเกษตรและสหกรณ์ (2564)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายชัยวุฒิ ธนาคมมานุสรณ์</strong> รัฐมนตรีว่าการกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม (2564)',
		icon: 'distrust'
	},
	{
		html_name: 'ลงมติ<strong>ร่างแก้ไขรัฐธรรมนูญ (ฉบับประชาชน - Resolution)</strong> (2564)',
		icon: 'normal'
	},
	{
		html_name: 'ลงมติ<strong>ร่าง พ.ร.บ. ปลดอาวุธ คสช. (ฉบับประชาชน)</strong> (2564)',
		icon: 'normal'
	},
	{ html_name: 'ลงมติ<strong>ร่าง พ.ร.บ. ปลดอาวุธ คสช</strong> (2564).', icon: 'normal' },
	{ html_name: 'ลงมติ<strong>ร่าง พ.ร.บ.งบประมาณฯ 2566</strong> (วาระ 1) (2565)', icon: 'normal' },
	{ html_name: 'ลงมติ<strong>ร่าง พ.ร.บ. สุราก้าวหน้า</strong> (วาระ 1) (2565)', icon: 'normal' },
	{
		html_name:
			'ลงมติ<strong>ร่าง พ.ร.บ. แพ่งและพาณิชย์ (สมรสเท่าเทียม) ฉบับก้าวไกล</strong> (วาระ 1) (2565)',
		icon: 'normal'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (2565)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายจุรินทร์ ลักษณวิศิษฏ์</strong> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์ (2565)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายอนุทิน ชาญวีรกูล</strong> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข (2565)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประวิตร วงษ์สุวรรณ</strong> รองนายกรัฐมนตรี (2565)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอก อนุพงษ์ เผ่าจินดา</strong> รัฐมนตรีว่าการกระทรวงมหาดไทย (2565)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายศักดิ์สยาม ชิดชอบ</strong> รัฐมนตรีว่าการกระทรวงคมนาคม (2565)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายชัยวุฒิ ธนาคมมานุสรณ์</strong> รัฐมนตรีว่าการกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม (2565)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายจุติ ไกรฤกษ์</strong> รัฐมนตรีว่าการกระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์ (2565)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสันติ พร้อมพัฒน์</strong> รัฐมนตรีช่วยว่าการกระทรวงการคลัง (2565)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายนิพนธ์ บุญญามณี</strong> รัฐมนตรีช่วยว่าการกระทรวงมหาดไทย (2565)',
		icon: 'distrust'
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสุชาติ ชมกลิ่น</strong> รัฐมนตรีว่าการกระทรวงแรงงาน (2565)',
		icon: 'distrust'
	}
];
