type VOTE_SUBJECT = {
	html_name: string;
	icon: 'choose' | 'normal' | 'distrust';
	pass: boolean | 'ประยุทธ์';
};

export const VOTE_METADATA: VOTE_SUBJECT[] = [
	{
		html_name: '<span class="b">ลงมติเลือกนายกรัฐมนตรี</span> (มิถุนายน 2562)',
		icon: 'choose',
		pass: 'ประยุทธ์'
	},
	{
		html_name:
			'พ.ร.ก. <span class="b">โอนอัตรากำลังพลและงบประมาณบางส่วน</span>ไปเป็นของหน่วยบัญชาการ<span class="b">ถวายความปลอดภัยรักษาพระองค์</span> (ตุลาคม 2562)',
		icon: 'normal',
		pass: true
	},
	{
		html_name: 'ลงมติ <span class="b">พ.ร.บ. งบประมาณฯ 2563</span> (วาระ 1) (ตุลาคม 2562)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'ตั้ง <span class="b">กมธ. วิสามัญ</span> เพื่อตรวจสอบและศึกษาติดตาม<span class="b">การละเมิดสิทธิมนุษยชนโดยรัฐ</span> (ธันวาคม 2562)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'ตั้ง <span class="b">กมธ. วิสามัญ</span> ศึกษาแนวทาง<span class="b">ป้องกันไม่ให้เกิดการรัฐประหารขึ้นอีกในอนาคต</span> (กุมภาพันธ์ 2563)',
		icon: 'normal',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</span> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พล.อ.ประวิตร วงษ์สุวรรณ</span> รองนายกรัฐมนตรี (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายวิษณุ เครืองาม</span> รองนายกรัฐมนตรี (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พล.อ.อนุพงษ์ เผ่าจินดา</span> รัฐมนตรีว่าการกระทรวงมหาดไทย (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายดอน ปรมัตถ์วินัย</span> รัฐมนตรีว่าการกระทรวงการต่างประเทศ (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - ร.อ.ธรรมนัส พรหมเผ่า</span> รัฐมนตรีช่วยว่าการเกษตรและสหกรณ์ (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'พิจารณา<span class="b">ร่างแก้ไขรัฐธรรมนูญ</span> - ฉบับที่ 1 แก้ไขเพิ่มเติมมาตรา 256 และเพิ่มหมวด 15/1 (นายสมพงษ์ อมรวิวัฒน์กับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'พิจารณา<span class="b">ร่างแก้ไขรัฐธรรมนูญ</span> - ฉบับที่ 2  แก้ไขเพิ่มเติมมาตรา 256 และเพิ่มหมวด 15/1 (นายวิรัช รัตนเศรษฐกับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'พิจารณา<span class="b">ร่างแก้ไขรัฐธรรมนูญ</span> - ฉบับที่ 3 ยกเลิกมาตรา 270 และมาตรา 271 (นายสมพงษ์กับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: false
	},
	{
		html_name:
			'พิจารณา<span class="b">ร่างแก้ไขรัฐธรรมนูญ</span> - ฉบับที่ 4 แก้ไขเพิ่มเติมมาตรา 259 และยกเลิกมาตรา 272 (นายสมพงษ์กับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: false
	},
	{
		html_name:
			'พิจารณา<span class="b">ร่างแก้ไขรัฐธรรมนูญ</span> - ฉบับที่ 5 ยกเลิกมาตรา 279 (นายสมพงษ์กับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: false
	},
	{
		html_name:
			'พิจารณา<span class="b">ร่างแก้ไขรัฐธรรมนูญ</span> - ฉบับที่ 6 แก้ไขเพิ่มเติมมาตรา 91 92 และ 94 และยกเลิกมาตรา 93 101 (4) และ 105 (3) (นายสมพงษ์กับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: false
	},
	{
		html_name:
			'พิจารณา<span class="b">ร่างแก้ไขรัฐธรรมนูญ</span> - ฉบับที่ 7 ยกเลิกมาตรา 65, 88, 203, 217, 270, 272, 275 และ 279 (ฉบับประชาชน ilaw) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</span> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประวิตร วงษ์สุวรรณ</span> รองนายกรัฐมนตรี (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายอนุทิน ชาญวีรกูล</span> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายจุรินทร์ ลักษณวิศิษฏ์</span> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์ (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอก อนุพงษ์ เผ่าจินดา</span> รัฐมนตรีว่าการกระทรวงมหาดไทย (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายณัฏฐพล ทีปสุวรรณ</span> รัฐมนตรีว่าการกระทรวงศึกษาธิการ (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสุชาติ ชมกลิ่น</span> รัฐมนตรีว่าการกระทรวงแรงงาน (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายศักดิ์สยาม ชิดชอบ</span> รัฐมนตรีว่าการกระทรวงคมนาคม (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายนิพนธ์ บุญญามณี</span> รัฐมนตรีช่วยว่าการกระทรวงมหาดไทย (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - ร้อยเอก ธรรมนัส พรมเผ่า</span> รัฐมนตรีช่วยว่าการเกษตรและสหกรณ์ (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: false
	},
	{ html_name: 'โหวต พ.ร.ก. เงินกู้ เพิ่มเติม (มิถุนายน 2564)', icon: 'normal', pass: true },
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</span> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (กันยายน 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายอนุทิน ชาญวีรกูล</span> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข (กันยายน 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสุชาติ ชมกลิ่น</span> รัฐมนตรีว่าการกระทรวงแรงงาน (กันยายน 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายศักดิ์สยาม ชิดชอบ</span> รัฐมนตรีว่าการกระทรวงคมนาคม (กันยายน 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายเฉลิมชัย ศรีอ่อน</span> รัฐมนตรีว่าการเกษตรและสหกรณ์ (กันยายน 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายชัยวุฒิ ธนาคมมานุสรณ์</span> รัฐมนตรีว่าการกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม (กันยายน 2564)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'ลงมติ<span class="b">ร่างแก้ไขรัฐธรรมนูญ (ฉบับประชาชน - Resolution)</span> (พฤศจิกายน 2564)',
		icon: 'normal',
		pass: false
	},
	{
		html_name: 'ลงมติ<span class="b">ร่าง พ.ร.บ. ปลดอาวุธ คสช. (ฉบับประชาชน)</span> (ธันวาคม 2564)',
		icon: 'normal',
		pass: false
	},
	{
		html_name: 'ลงมติ<span class="b">ร่าง พ.ร.บ. ปลดอาวุธ คสช</span> (ธันวาคม 2564).',
		icon: 'normal',
		pass: false
	},
	{
		html_name: 'ลงมติ<span class="b">ร่าง พ.ร.บ.งบประมาณฯ 2566</span> (วาระ 1) (มิถุนายน 2565)',
		icon: 'normal',
		pass: true
	},
	{
		html_name: 'ลงมติ<span class="b">ร่าง พ.ร.บ. สุราก้าวหน้า</span> (วาระ 1) (มิถุนายน 2565)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'ลงมติ<span class="b">ร่าง พ.ร.บ. แพ่งและพาณิชย์ (สมรสเท่าเทียม) ฉบับก้าวไกล</span> (วาระ 1) (มิถุนายน 2565)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</span> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายจุรินทร์ ลักษณวิศิษฏ์</span> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์ (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายอนุทิน ชาญวีรกูล</span> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประวิตร วงษ์สุวรรณ</span> รองนายกรัฐมนตรี (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอก อนุพงษ์ เผ่าจินดา</span> รัฐมนตรีว่าการกระทรวงมหาดไทย (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายศักดิ์สยาม ชิดชอบ</span> รัฐมนตรีว่าการกระทรวงคมนาคม (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายชัยวุฒิ ธนาคมมานุสรณ์</span> รัฐมนตรีว่าการกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายจุติ ไกรฤกษ์</span> รัฐมนตรีว่าการกระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์ (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสันติ พร้อมพัฒน์</span> รัฐมนตรีช่วยว่าการกระทรวงการคลัง (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายนิพนธ์ บุญญามณี</span> รัฐมนตรีช่วยว่าการกระทรวงมหาดไทย (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	},
	{
		html_name:
			'<span class="b">อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสุชาติ ชมกลิ่น</span> รัฐมนตรีว่าการกระทรวงแรงงาน (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: false
	}
];
