type VOTE_SUBJECT = {
	html_name: string;
	icon: 'choose' | 'normal' | 'distrust';
	pass: boolean | 'ประยุทธ์';
};

export const VOTE_METADATA: VOTE_SUBJECT[] = [
	{
		html_name: '<strong>ลงมติเลือกนายกรัฐมนตรี</strong> (มิถุนายน 2562)',
		icon: 'choose',
		pass: 'ประยุทธ์'
	},
	{
		html_name:
			'พ.ร.ก.<strong>โอนอัตรากำลังพลและงบประมาณบางส่วน</strong>ไปเป็นของหน่วยบัญชาการ<strong>ถวายความปลอดภัยรักษาพระองค์</strong> (ตุลาคม 2562)',
		icon: 'normal',
		pass: true
	},
	{
		html_name: 'ลงมติ<strong>พ.ร.บ.งบประมาณฯ 2563</strong> (วาระ 1) (ตุลาคม 2562)',
		icon: 'normal',
		pass: false
	},
	{
		html_name:
			'ตั้ง <strong>กมธ.วิสามัญ</strong> เพื่อตรวจสอบและศึกษาติดตาม<strong>การละเมิดสิทธิมนุษยชนโดยรัฐ</strong> (ธันวาคม 2562)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'ตั้ง <strong>กมธ. วิสามัญ</strong> ศึกษาแนวทาง<strong>ป้องกันไม่ให้เกิดการรัฐประหารขึ้นอีกในอนาคต</strong> (กุมภาพันธ์ 2563)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พล.อ.ประวิตร วงษ์สุวรรณ</strong> รองนายกรัฐมนตรี (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายวิษณุ เครืองาม</strong> รองนายกรัฐมนตรี (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พล.อ.อนุพงษ์ เผ่าจินดา</strong> รัฐมนตรีว่าการกระทรวงมหาดไทย (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายดอน ปรมัตถ์วินัย</strong> รัฐมนตรีว่าการกระทรวงการต่างประเทศ (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - ร.อ.ธรรมนัส พรหมเผ่า</strong> รัฐมนตรีช่วยว่าการเกษตรและสหกรณ์ (กุมภาพันธ์ 2563)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'พิจารณา<strong>ร่างแก้ไขรัฐธรรมนูญ</strong> - ฉบับที่ 1 แก้ไขเพิ่มเติมมาตรา 256 และเพิ่มหมวด 15/1 (นายสมพงษ์ อมรวิวัฒน์กับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'พิจารณา<strong>ร่างแก้ไขรัฐธรรมนูญ</strong> - ฉบับที่ 2  แก้ไขเพิ่มเติมมาตรา 256 และเพิ่มหมวด 15/1 (นายวิรัช รัตนเศรษฐกับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'พิจารณา<strong>ร่างแก้ไขรัฐธรรมนูญ</strong> - ฉบับที่ 3 ยกเลิกมาตรา 270 และมาตรา 271 (นายสมพงษ์กับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'พิจารณา<strong>ร่างแก้ไขรัฐธรรมนูญ</strong> - ฉบับที่ 4 แก้ไขเพิ่มเติมมาตรา 259 และยกเลิกมาตรา 272 (นายสมพงษ์กับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'พิจารณา<strong>ร่างแก้ไขรัฐธรรมนูญ</strong> - ฉบับที่ 5 ยกเลิกมาตรา 279 (นายสมพงษ์กับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'พิจารณา<strong>ร่างแก้ไขรัฐธรรมนูญ</strong> - ฉบับที่ 6 แก้ไขเพิ่มเติมมาตรา 91 92 และ 94 และยกเลิกมาตรา 93 101 (4) และ 105 (3) (นายสมพงษ์กับคณะ เป็นผู้เสนอ) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'พิจารณา<strong>ร่างแก้ไขรัฐธรรมนูญ</strong> - ฉบับที่ 7 ยกเลิกมาตรา 65, 88, 203, 217, 270, 272, 275 และ 279 (ฉบับประชาชน ilaw) (พฤศจิกายน 2563)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประวิตร วงษ์สุวรรณ</strong> รองนายกรัฐมนตรี (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายอนุทิน ชาญวีรกูล</strong> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายจุรินทร์ ลักษณวิศิษฏ์</strong> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์ (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอก อนุพงษ์ เผ่าจินดา</strong> รัฐมนตรีว่าการกระทรวงมหาดไทย (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายณัฏฐพล ทีปสุวรรณ</strong> รัฐมนตรีว่าการกระทรวงศึกษาธิการ (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสุชาติ ชมกลิ่น</strong> รัฐมนตรีว่าการกระทรวงแรงงาน (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายศักดิ์สยาม ชิดชอบ</strong> รัฐมนตรีว่าการกระทรวงคมนาคม (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายนิพนธ์ บุญญามณี</strong> รัฐมนตรีช่วยว่าการกระทรวงมหาดไทย (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - ร้อยเอก ธรรมนัส พรมเผ่า</strong> รัฐมนตรีช่วยว่าการเกษตรและสหกรณ์ (กุมภาพันธ์ 2564)',
		icon: 'distrust',
		pass: true
	},
	{ html_name: 'โหวตพ.ร.ก.เงินกู้ เพิ่มเติม (มิถุนายน 2564)', icon: 'normal', pass: true },
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (กันยายน 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายอนุทิน ชาญวีรกูล</strong> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข (กันยายน 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสุชาติ ชมกลิ่น</strong> รัฐมนตรีว่าการกระทรวงแรงงาน (กันยายน 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายศักดิ์สยาม ชิดชอบ</strong> รัฐมนตรีว่าการกระทรวงคมนาคม (กันยายน 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายเฉลิมชัย ศรีอ่อน</strong> รัฐมนตรีว่าการเกษตรและสหกรณ์ (กันยายน 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายชัยวุฒิ ธนาคมมานุสรณ์</strong> รัฐมนตรีว่าการกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม (กันยายน 2564)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'ลงมติ<strong>ร่างแก้ไขรัฐธรรมนูญ (ฉบับประชาชน - Resolution)</strong> (พฤศจิกายน 2564)',
		icon: 'normal',
		pass: true
	},
	{
		html_name: 'ลงมติ<strong>ร่าง พ.ร.บ. ปลดอาวุธ คสช. (ฉบับประชาชน)</strong> (ธันวาคม 2564)',
		icon: 'normal',
		pass: true
	},
	{
		html_name: 'ลงมติ<strong>ร่าง พ.ร.บ. ปลดอาวุธ คสช</strong> (ธันวาคม 2564).',
		icon: 'normal',
		pass: true
	},
	{
		html_name: 'ลงมติ<strong>ร่าง พ.ร.บ.งบประมาณฯ 2566</strong> (วาระ 1) (มิถุนายน 2565)',
		icon: 'normal',
		pass: true
	},
	{
		html_name: 'ลงมติ<strong>ร่าง พ.ร.บ. สุราก้าวหน้า</strong> (วาระ 1) (มิถุนายน 2565)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'ลงมติ<strong>ร่าง พ.ร.บ. แพ่งและพาณิชย์ (สมรสเท่าเทียม) ฉบับก้าวไกล</strong> (วาระ 1) (มิถุนายน 2565)',
		icon: 'normal',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประยุทธ์ จันทร์โอชา</strong> นายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงกลาโหม (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายจุรินทร์ ลักษณวิศิษฏ์</strong> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์ (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายอนุทิน ชาญวีรกูล</strong> รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอกประวิตร วงษ์สุวรรณ</strong> รองนายกรัฐมนตรี (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - พลเอก อนุพงษ์ เผ่าจินดา</strong> รัฐมนตรีว่าการกระทรวงมหาดไทย (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายศักดิ์สยาม ชิดชอบ</strong> รัฐมนตรีว่าการกระทรวงคมนาคม (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายชัยวุฒิ ธนาคมมานุสรณ์</strong> รัฐมนตรีว่าการกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายจุติ ไกรฤกษ์</strong> รัฐมนตรีว่าการกระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์ (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสันติ พร้อมพัฒน์</strong> รัฐมนตรีช่วยว่าการกระทรวงการคลัง (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายนิพนธ์ บุญญามณี</strong> รัฐมนตรีช่วยว่าการกระทรวงมหาดไทย (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	},
	{
		html_name:
			'<strong>อภิปรายไม่ไว้วางใจรัฐมนตรีรายบุคคล - นายสุชาติ ชมกลิ่น</strong> รัฐมนตรีว่าการกระทรวงแรงงาน (กรกฎาคม 2565)',
		icon: 'distrust',
		pass: true
	}
];
